
Feature: Търсене на офиси за немане в различни държави и градове

  Scenario Outline: Наем на кола в различни държави и градове
    Given Клиентът зарежда страницата за резервация
    When Клиентът селектира държава от падащия лист "<country>"
    And Селектира град от новогенериран лист за избраната държава "<city>"
    And Селектира локация "<location>"
    And Натиска бутона за търсене на фирми
    Then Излиза съобщение "<message>"

    Examples: 
      | country     |   city     | location  | message                                       |
      |  Финландия  |  Тампере   |   airport |  Има открити резултати                        |
      |  Тувалу     |   none     |   none    |  Няма открити резултати за посочената държава |
      |  Финландия  |  fdokfe    |   none    |  Няма открити резултати за посочения град     | 
      |             |            |           |  Моля изберете държава                        |     
      |  Финландия  |            |           |  Моля изберете град                           | 
      |  Финландия  |  Тампере   |           |  Моля изберете локация                        | 